BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ВидыРаботСельхозтехники/ИНАГРО_ВидыРаботСельхозтехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ВидыРаботСельхозтехники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НадбавкаЗаНорму</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВыработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаГСМПо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаРасходаТоплива</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Помощник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗаВредность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасценкаК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СменныхНормОт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдержанияЗаНорму</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Яды</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасценкаЗависитОтКультуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОплатыПомощников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.ИНАГРО_ТехнологическиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркаСельхозтехники</name>
    <type>
      <types>CatalogRef.ИНАГРО_МоделиТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркаАгрегата</name>
    <type>
      <types>CatalogRef.ИНАГРО_МоделиТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыТехники/ИНАГРО_ВидыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыТехники</name>
  <enumValues>
    <name>Автотранспорт</name>
  </enumValues>
  <enumValues>
    <name>Сельхозтехника</name>
  </enumValues>
  <enumValues>
    <name>Агрегат</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ВидыРаботСельхозтехники/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	

	УправлениеФормой(ЭтаФорма); 

КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.МаркаСельхозтехники) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена Марка сельхозтехники!';uk='Не заповнена Марка сільгосптехніки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.МаркаСельхозтехники", , Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МаркаСельхозтехникиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;	
	Отбор.Вставить("ВидТехники", ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыТехники.Сельхозтехника"));
		
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
	ОткрытьФорму("Справочник.ИНАГРО_МоделиТС.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаАгрегатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;	
	Отбор.Вставить("ВидТехники", ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыТехники.Агрегат"));
		
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
	ОткрытьФорму("Справочник.ИНАГРО_МоделиТС.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПомощникПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	Если НЕ Запись.Помощник Тогда
		Запись.ПроцентОплатыПомощников = 0;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Запись	 = Форма.Запись; 
		
	Элементы.ПроцентОплатыПомощников.Доступность = Запись.Помощник;
	
КонецПроцедуры  

#КонецОбласти
